Revit 2026 API

# DimensionTypeAlternateUnitsPrefix Property

---

The prefix text for the alternate units value.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public string AlternateUnitsPrefix { get; set; }
```
```vb
Public Property AlternateUnitsPrefix As String
	Get
	Set
```
```cpp
public:
property String^ AlternateUnitsPrefix {
	String^ get ();
	void set (String^ value);
}
```
```fsharp
member AlternateUnitsPrefix : string with get, set
```

#### Property Value

String

| Exception | Condition |
| --- | --- |
| ArgumentNullException | When setting this property: A non-optional argument was null |

#### Reference

DimensionType Class

Autodesk.Revit.DB Namespace